from bot.consts import LANG_RU, LANG_EN

messages = {
    LANG_RU: {
        'start':
            u'Привет!\n\n'
            u'Я <strong>Стартап-Трибуна Бот</strong>.\n\n'
            u'С моей помощью ты можешь презентовать свой продукт или идею '
            u'в <a href="https://t.me/stribuna">телеграм-канале</a>, '
            u'где ее увидят и оценят другие люди.\n\n'
            u'Это позволит тебе быстро получить фидбек, найти новых пользователей, клиентов и даже партнеров.\n\n'
            u'⚠️ Прежде чем твой рассказ будет опубликован, '
            u'он должен пройти модерацию – это нужно, чтобы защититься от спама и откровенного скама.',

        'project_description':
            u'Напиши краткий рассказ о своем продукте:\n'
            u'1. Название\n'
            u'2. Ссылка на сайт\n'
            u'3. Какую проблему вы решаете?\n'
            u'4. Как вы решаете проблему?',

        'publish_project':
            u'Отлично!\n'
            u'Если все готово – нажми <strong>"Отправить на модерацию"</strong>, '
            u'и после недолгой проверки мы опубликуем твой рассказ.',

        'project_published':
            u'Спасибо!\n'
            u'Твой рассказ будет опубликован в <a href="https://t.me/stribuna">телеграм-канале</a>, '
            u'как только он пройдет модерацию.',

        'about':
            u'<strong>Tribuna Bot</strong> – экспериментальный формат презентации своих проектов.\n\n'
            u'С этой задачей прекрасно справляется '
            u'<a href="https://vc.ru/tribuna">"Трибуна" vc.ru</a>, однако, ее формат – лонгрид, '
            u'писать и читать который осилит далеко не каждый.\n\n'
            u'Наша задача – в нескольких предложениях описать продукт, выставить его на всеобщее обозрение '
            u'и максимально быстро получить фидбек. Каждая идея после проверки на спам и скам '
            u'сразу же попадает в <a href="https://t.me/stribuna">телеграм-канал</a>, '
            u'где собирает полезные для автора реакции и комментарии.\n\n'
            u'Один раз в неделю бот автоматически собирает самые залайканные и закомментированные посты, '
            u'из которых делает подборку самых интересных проектов.\n\n'
            u'Если у вас есть пожелания или идеи по улучшению бота – пишите @lounvhx.',
    },
    LANG_EN: {
        'start': 'TODO',
        'new_idea': 'TODO',
        'about': 'TODO',
    }
}
